20241211T011547--kdoc-323-ノベルゲームバンドルづくり__draft_project.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-02-01 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 323: ノベルゲームバンドルづくり</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 323: ノベルゲームバンドルづくり</h1>

<div id="outline-container-org78463e4" class="outline-2">
<h2 id="org78463e4"><a href="#org78463e4">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org78463e4">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-12-15 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5d0ab49" class="outline-2">
<h2 id="org5d0ab49"><a href="#org5d0ab49"><span class="todo WIP">WIP</span> プロジェクトステータス</a></h2>
<div class="outline-text-2" id="text-org5d0ab49">
<p>
プロジェクトは進行中である。
</p>
</div>
</div>

<div id="outline-container-orga1b9f40" class="outline-2">
<h2 id="orga1b9f40"><a href="#orga1b9f40">概要</a></h2>
<div class="outline-text-2" id="text-orga1b9f40">
<p>
著作権の問題のない文章を、ノベルゲーム風にして名文を手軽に読めるようにする。
</p>
</div>
</div>
<div id="outline-container-orgb79deb3" class="outline-2">
<h2 id="orgb79deb3"><a href="#orgb79deb3">なぜ作ったか</a></h2>
<div class="outline-text-2" id="text-orgb79deb3">
<p>
なぜ作ったか。
</p>

<ul class="org-ul">
<li>青空文庫などで、歴史的文学がただで大量に公開されている。しかし、それらがじゅうぶんに活用されているとはいえない。その面白さや奥深さに比して、読んだことのあるものは少ない。読もうと考えた機会はあったものの、すべて読み通せたものは多くない。個人的にもそうだし、体感的に、そもそも存在を知らない人も多い</li>
<li>著作権の切れた本はAmazon Kindleなどでも無料で販売されていて、端末にダウンロードはしていた。しかし読む気になれず、ずっと未読のままで眠っている</li>
</ul>

<p>
原因は、われわれがおかれた環境にあるように見える。娯楽は即効性を求めるようになっている。無限にあるコンテンツのなかで視聴にたるかどうかは、最初の数十秒〜数十分で判断する。本の世界を認識するための叙述…のどかな時代特有の長々とした序盤…を読み終える前に脱落することが多い。名作であるもののなかには、序盤が退屈に感じたり世界に入りこむのが大変なものもある。
</p>

<p>
そこで、ノベルゲームの表示スタイルで再生できるようにした。
</p>

<ul class="org-ul">
<li>少しづつ文字が表示されるので圧倒されない</li>
<li>リズムがつきやすい</li>
<li>背景によって、場面のイメージがつきやすい</li>
</ul>

<p>
また、別の方向性として、明治〜昭和の時代背景であったり地理(特に東京)は、読むうえで必要な前提知識となっている。さらに、書いた人物の実在を感じる情報…住んだ家や生い立ち、家族構成、専門領域、好物…を知っているほど読みやすくなる。そのあたりを得るためのヒントを提供できればよいと考えている。
</p>
</div>
</div>

<div id="outline-container-org8693794" class="outline-2">
<h2 id="org8693794"><a href="#org8693794">仕様の方針</a></h2>
<div class="outline-text-2" id="text-org8693794">
<ul class="org-ul">
<li>ノベルゲームエンジンの仕様に関する知見は持っていない。すでにデファクトとなっているエンジンやゲームの仕様を参考にし、仕様ぎめの労力をなくした</li>
<li>ノベルゲームにありがちな、音楽/立ち絵/エフェクトといった機能は搭載しない。単純にそれらのメディアを作るリソースがない</li>
<li>ただで配布するものなので、コストは極力かけない。作業者は自分しかいないので、テキストや背景の加工を極力自動でできるようにする</li>
<li>気軽に試せるように、ブラウザで実行できること</li>
<li>開発の勉強になること。読むことだけ考えれば、既存のノベルゲームエンジンに載せるのが一番はやい。しかしそれだと開発の勉強にならない。勉強の観点からいって、最低限の機能をもったライブラリを使うのが望ましい</li>
<li>とりあえずたいした状態保持は必要ない。ローカルストレージやファイルで保持する</li>
</ul>
</div>
</div>

<div id="outline-container-org46faa05" class="outline-2">
<h2 id="org46faa05"><a href="#org46faa05">段階</a></h2>
<div class="outline-text-2" id="text-org46faa05">
<ul class="org-ul">
<li>メモ化のためどうせ変数に入れるのだから、UI用の画像類はまとめて読み込んでいたほうがよい</li>
<li>セーブ機能
<ul class="org-ul">
<li>タイトルとチャプター</li>
</ul></li>
<li>既読機能</li>
<li>実績機能</li>
<li>自動文字送り機能</li>
<li>直前の文字表示機能</li>
<li>リリース</li>
</ul>
</div>
</div>

<div id="outline-container-org59fef15" class="outline-2">
<h2 id="org59fef15"><a href="#org59fef15">Tasks</a></h2>
<div class="outline-text-2" id="text-org59fef15">
</div>
<div id="outline-container-orgbd33acb" class="outline-3">
<h3 id="orgbd33acb"><a href="#orgbd33acb"><span class="todo TODO">TODO</span> シナリオを100個集める</a></h3>
<div class="outline-text-3" id="text-orgbd33acb">
<p>
地道に収集する。
</p>
</div>
</div>
<div id="outline-container-org62e1687" class="outline-3">
<h3 id="org62e1687"><a href="#org62e1687"><span class="todo TODO">TODO</span> UIをリファクタ</a></h3>
<div class="outline-text-3" id="text-org62e1687">
<p>
ボタンなどはそういう関数に、各自で指定してる色は変数にまとめる。
</p>
</div>
</div>
<div id="outline-container-orgb25c23b" class="outline-3">
<h3 id="orgb25c23b"><a href="#orgb25c23b"><span class="todo TODO">TODO</span> startラベルの先頭が常に実行される</a></h3>
<div class="outline-text-3" id="text-orgb25c23b">
<pre class="example">
*start
[image source="black.png"]
『こころ』夏目漱石
</pre>

<p>
ほかのラベルに飛んでも、黒画像の設定が実行される。もし文字を入れると、それが実行される。
</p>
</div>
</div>
<div id="outline-container-orge2ba38d" class="outline-3">
<h3 id="orge2ba38d"><a href="#orge2ba38d"><span class="todo TODO">TODO</span> シナリオジャンプごとに背景をリセットする</a></h3>
<div class="outline-text-3" id="text-orge2ba38d">
<p>
今は残り続ける。よくないことが多い。
</p>

<p>
チャプタージャンプ時にイベント通知すればよさそうか。
</p>
</div>
</div>
<div id="outline-container-orgd742349" class="outline-3">
<h3 id="orgd742349"><a href="#orgd742349"><span class="todo TODO">TODO</span> フェードアウト/イン</a></h3>
<div class="outline-text-3" id="text-orgd742349">
<p>
背景画像を変えるとき、パッと変わって見苦しい。場面転換のときは黒にフェードアウトするとかしたい。
</p>
</div>
</div>
<div id="outline-container-orga3969b3" class="outline-3">
<h3 id="orga3969b3"><a href="#orga3969b3"><span class="todo TODO">TODO</span> 作品を読む</a></h3>
<div class="outline-text-3" id="text-orga3969b3">
<p>
ひたすら読んで微調整する。
</p>
</div>
</div>
</div>
<div id="outline-container-orgda3a585" class="outline-2">
<h2 id="orgda3a585"><a href="#orgda3a585">Archives</a></h2>
<div class="outline-text-2" id="text-orgda3a585">
</div>
<div id="outline-container-org79ebe58" class="outline-3">
<h3 id="org79ebe58"><a href="#org79ebe58"><span class="done DONE">DONE</span> セーブ機能</a></h3>
<div class="outline-text-3" id="text-org79ebe58">
<p>
セーブできるようにする。まずはオンメモリでやって、次に永続化・ロードできるようにする。
</p>

<ul class="org-ul">
<li>シナリオに1つでいいだろう</li>
<li>トップメニュー
<ul class="org-ul">
<li>こころ ch4 位置45</li>
<li>明暗 ch5 位置23</li>
</ul></li>
<li>クリックすると、「読込」「削除」ができる</li>
<li>ポーズ画面では保存ができる。スロットに保存ずみの情報が表示され、保存されたことが確認できる</li>
<li>あとでファイル化しやすい形でないといけない</li>
</ul>
</div>
</div>
<div id="outline-container-org7017d6d" class="outline-3">
<h3 id="org7017d6d"><a href="#org7017d6d"><span class="done DONE">DONE</span> 収録冊数を表示する</a></h3>
<div class="outline-text-3" id="text-org7017d6d">
<p>
表示してわかるようにする。
</p>
</div>
</div>
<div id="outline-container-org31a1521" class="outline-3">
<h3 id="org31a1521"><a href="#org31a1521"><span class="done DONE">DONE</span> 既読機能</a></h3>
<div class="outline-text-3" id="text-org31a1521">
<p>
既読チェックを付けられるようにする。
</p>
</div>
</div>
</div>

<div id="outline-container-org99e7220" class="outline-2">
<h2 id="org99e7220"><a href="#org99e7220">関連</a></h2>
<div class="outline-text-2" id="text-org99e7220">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
